![cover](cover/15.%20Melt%20Function.png)

#### Outline
* ID Vars
* Value Vars
* Var Name
* Value Name

### Melt

The melt function allows us to restructure a dataset from a wide-format dataset to a long-format dataset

**Figure 1**

*melt() function demonstration*

<img src="diagrams/melt.png" alt="pivot table" width="700">

*A diagram depicting the melt() function applied to a wide-format dataframe, below a long-format dataframe is produced*

##### Import Pandas

In [1]:
import pandas

##### Import Datasets

In [2]:
visits = pandas.read_csv('./datasets/web_visits.csv')
scores = pandas.read_csv('./datasets/student_scores.csv')

In [3]:
visits

         date  home  about  contact  products  blog
0  2026-02-21   120     30       10        80    45
1  2026-02-22    95     40       12        90    50
2  2026-02-23   110     35       15       100    60
3  2026-02-24   130     45       20       120    70
4  2026-02-25   100     25        8        75    40

In [4]:
scores

  student  math  science  history  english  music
0   Alice    78       82       75       88     91
1   Brian    85       79       80       90     87
2   Clara    92       88       84       95     89

### melt()

`pandas.melt(dataset)`</br>

`dataset.melt(dataset)`

Gives us a direct comparison of each variable-value pair in the dataset

In [5]:
visits.melt()   # melt the dataset

    variable       value
0       date  2026-02-21
1       date  2026-02-22
2       date  2026-02-23
3       date  2026-02-24
4       date  2026-02-25
5       home         120
6       home          95
7       home         110
8       home         130
9       home         100
10     about          30
11     about          40
12     about          35
13     about          45
14     about          25
15   contact          10
16   contact          12
17   contact          15
18   contact          20
19   contact           8
20  products          80
21  products          90
22  products         100
23  products         120
24  products          75
25      blog          45
26      blog          50
27      blog          60
28      blog          70
29      blog          40

In [6]:
scores.melt()   # melt the dataset

   variable  value
0   student  Alice
1   student  Brian
2   student  Clara
3      math     78
4      math     85
5      math     92
6   science     82
7   science     79
8   science     88
9   history     75
10  history     80
11  history     84
12  english     88
13  english     90
14  english     95
15    music     91
16    music     87
17    music     89

In [7]:
# differnt notation
pandas.melt(scores)

   variable  value
0   student  Alice
1   student  Brian
2   student  Clara
3      math     78
4      math     85
5      math     92
6   science     82
7   science     79
8   science     88
9   history     75
10  history     80
11  history     84
12  english     88
13  english     90
14  english     95
15    music     91
16    music     87
17    music     89

### id_vars

`dataset.melt(id_vars=[''])`

Allows us to chose the id column(s)

In [8]:
scores.melt(id_vars='student')  # set the id_var column

   student variable  value
0    Alice     math     78
1    Brian     math     85
2    Clara     math     92
3    Alice  science     82
4    Brian  science     79
5    Clara  science     88
6    Alice  history     75
7    Brian  history     80
8    Clara  history     84
9    Alice  english     88
10   Brian  english     90
11   Clara  english     95
12   Alice    music     91
13   Brian    music     87
14   Clara    music     89

In [9]:
visits.melt(id_vars='date') # set the id_var column

          date  variable  value
0   2026-02-21      home    120
1   2026-02-22      home     95
2   2026-02-23      home    110
3   2026-02-24      home    130
4   2026-02-25      home    100
5   2026-02-21     about     30
6   2026-02-22     about     40
7   2026-02-23     about     35
8   2026-02-24     about     45
9   2026-02-25     about     25
10  2026-02-21   contact     10
11  2026-02-22   contact     12
12  2026-02-23   contact     15
13  2026-02-24   contact     20
14  2026-02-25   contact      8
15  2026-02-21  products     80
16  2026-02-22  products     90
17  2026-02-23  products    100
18  2026-02-24  products    120
19  2026-02-25  products     75
20  2026-02-21      blog     45
21  2026-02-22      blog     50
22  2026-02-23      blog     60
23  2026-02-24      blog     70
24  2026-02-25      blog     40

### var_name

`dataset.melt(var_name='')`

Allows us to name the variables column

In [10]:
scores.melt(id_vars='student', var_name = 'subject')    # change the name of the variable column

   student  subject  value
0    Alice     math     78
1    Brian     math     85
2    Clara     math     92
3    Alice  science     82
4    Brian  science     79
5    Clara  science     88
6    Alice  history     75
7    Brian  history     80
8    Clara  history     84
9    Alice  english     88
10   Brian  english     90
11   Clara  english     95
12   Alice    music     91
13   Brian    music     87
14   Clara    music     89

In [11]:
visits.melt(id_vars='date', var_name='page')    # change the name of the variable column

          date      page  value
0   2026-02-21      home    120
1   2026-02-22      home     95
2   2026-02-23      home    110
3   2026-02-24      home    130
4   2026-02-25      home    100
5   2026-02-21     about     30
6   2026-02-22     about     40
7   2026-02-23     about     35
8   2026-02-24     about     45
9   2026-02-25     about     25
10  2026-02-21   contact     10
11  2026-02-22   contact     12
12  2026-02-23   contact     15
13  2026-02-24   contact     20
14  2026-02-25   contact      8
15  2026-02-21  products     80
16  2026-02-22  products     90
17  2026-02-23  products    100
18  2026-02-24  products    120
19  2026-02-25  products     75
20  2026-02-21      blog     45
21  2026-02-22      blog     50
22  2026-02-23      blog     60
23  2026-02-24      blog     70
24  2026-02-25      blog     40

### value_name

`dataset.melt(value_name='')`

Allows us to name the values column

In [12]:
scores.melt(id_vars='student', var_name = 'subject', value_name='score')    # change the names of both columns

   student  subject  score
0    Alice     math     78
1    Brian     math     85
2    Clara     math     92
3    Alice  science     82
4    Brian  science     79
5    Clara  science     88
6    Alice  history     75
7    Brian  history     80
8    Clara  history     84
9    Alice  english     88
10   Brian  english     90
11   Clara  english     95
12   Alice    music     91
13   Brian    music     87
14   Clara    music     89

In [13]:
visits.melt(id_vars='date', var_name='page', value_name='visits')   # change the names of both columns

          date      page  visits
0   2026-02-21      home     120
1   2026-02-22      home      95
2   2026-02-23      home     110
3   2026-02-24      home     130
4   2026-02-25      home     100
5   2026-02-21     about      30
6   2026-02-22     about      40
7   2026-02-23     about      35
8   2026-02-24     about      45
9   2026-02-25     about      25
10  2026-02-21   contact      10
11  2026-02-22   contact      12
12  2026-02-23   contact      15
13  2026-02-24   contact      20
14  2026-02-25   contact       8
15  2026-02-21  products      80
16  2026-02-22  products      90
17  2026-02-23  products     100
18  2026-02-24  products     120
19  2026-02-25  products      75
20  2026-02-21      blog      45
21  2026-02-22      blog      50
22  2026-02-23      blog      60
23  2026-02-24      blog      70
24  2026-02-25      blog      40

### For Source code:
https://sites.google.com/view/aorbtech/programming/

#### @Aorb Tech